app/views/carparks/show.html.erb

SELECT "lots".* FROM "lots" WHERE "lots"."carpark_id" = $1  [["carpark_id", 2]]
---

 <% @carpark.lot.each do |lot| %>