app/views/lots/index.html.erb

SELECT  "lots".* FROM "lots" WHERE "lots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

 <% @carpark.lot.each do |lot| %>