app/views/lots/index.html.erb

SELECT COUNT(*) FROM "lots" WHERE "lots"."carpark_id" = $1  [["carpark_id", 5]]
SELECT "lots".* FROM "lots" WHERE "lots"."carpark_id" = $1  [["carpark_id", 1]]
---
	<div class="col-12 text-center border pt-4 pb-4">
<h2>Lots allocated:  <%= @carpark.lots.count %></h2>