app/controllers/carparks_controller.rb

SELECT "carparks".* FROM "carparks"
---
  def index
    @carparks = Carpark.all

INSERT INTO "carparks" ("location", "totallots", "photo_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["location", "test 1"], ["totallots", 5], ["photo_url", "3fdsafasf"], ["created_at", "2020-05-19 01:50:34.924148"], ["updated_at", "2020-05-19 01:50:34.924148"]]
---
  def create
    @carpark = Carpark.new(carpark_params)

    @carpark.save

SELECT  "carparks".* FROM "carparks" WHERE "carparks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
      @carpark = Carpark.find(params[:id])

SELECT  "carparks".* FROM "carparks" WHERE "carparks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "lots".* FROM "lots" WHERE "lots"."carpark_id" = $1 AND "lots"."taken" = $2 LIMIT $3  [["carpark_id", 2], ["taken", true], ["LIMIT", 11]]
---
def edit
  @carpark = Carpark.find(params[:id])
  @lots = @carpark.lot.where(taken: false)

SELECT  "carparks".* FROM "carparks" WHERE "carparks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "lots".* FROM "lots" WHERE "lots"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "carparks" SET "reservedlots" = $1, "updated_at" = $2 WHERE "carparks"."id" = $3  [["reservedlots", 1], ["updated_at", "2020-05-18 14:41:40.250430"], ["id", 2]]
UPDATE "lots" SET "taken" = $1, "updated_at" = $2 WHERE "lots"."id" = $3  [["taken", true], ["updated_at", "2020-05-18 14:41:40.258930"], ["id", 9]]
UPDATE "carparks" SET "reservedlots" = $1, "updated_at" = $2 WHERE "carparks"."id" = $3  [["reservedlots", 1], ["updated_at", "2020-05-18 13:08:19.286291"], ["id", 1]]
---
def update
  puts "in the weird update path"
  @carpark = Carpark.find(params[:id])
  @lot = Lot.find(params[:carpark].values[0].to_i)

  puts params[:carpark].values[0]
  puts @carpark.location
  puts @lot.lotNumber
  @carpark.update(reservedlots: @carpark.reservedlots+1)
  @lot.update(taken: true)

SELECT  "carparks".* FROM "carparks" WHERE "carparks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "lots".* FROM "lots" WHERE "lots"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "carparks".* FROM "carparks" WHERE "carparks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "lots" SET "taken" = $1, "updated_at" = $2 WHERE "lots"."id" = $3  [["taken", false], ["updated_at", "2020-05-18 15:00:54.611439"], ["id", 9]]
UPDATE "carparks" SET "reservedlots" = $1, "updated_at" = $2 WHERE "carparks"."id" = $3  [["reservedlots", 0], ["updated_at", "2020-05-18 14:58:27.872996"], ["id", 2]]
---
  def destroy
      #if Boardfollowee.exists?(user_id: current_user.id, boardfollowee_id: params[:id] )
      #puts "does exist"
      #  @boardfollowee = Boardfollowee.find_by user_id: current_user.id, boardfollowee_id: params[:id]
      puts "Test for method"
      @lot = Lot.find(params[:carpark].values[0].to_i)
      puts @lot.lotNumber
      @carpark = Carpark.find(params[:id])
      @carpark.update(reservedlots: @carpark.reservedlots-1)
      @lot.update(taken: false)