app/controllers/lots_controller.rb

SELECT  "carparks".* FROM "carparks" WHERE "carparks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "lots" WHERE "lots"."carpark_id" = $1  [["carpark_id", 5]]
---
  def index
    @carpark = Carpark.find(params[:id])
    puts @carpark.lot.count

SELECT  "carparks".* FROM "carparks" WHERE "carparks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "lots" ("lotNumber", "created_at", "updated_at", "carpark_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["lotNumber", "12a"], ["created_at", "2020-05-19 03:12:34.697179"], ["updated_at", "2020-05-19 03:12:34.697179"], ["carpark_id", 5]]
SELECT COUNT(*) FROM "lots" WHERE "lots"."carpark_id" = $1  [["carpark_id", 10]]
UPDATE "carparks" SET "totallots" = $1, "updated_at" = $2 WHERE "carparks"."id" = $3  [["totallots", 8], ["updated_at", "2020-05-19 03:14:38.009205"], ["id", 10]]
---
  def create
    @lot = Lot.new(lot_params)
    puts " i have entered here"
    @carpark = Carpark.find(params[:id])
    @lot.carpark = @carpark
    @lot.save
    @carpark.update(totallots: @carpark.lot.count)

SELECT  "lots".* FROM "lots" WHERE "lots"."id" = $1 LIMIT $2  [["id", 60], ["LIMIT", 1]]
---
  def show
      @lot = Lot.find(params[:id])

SELECT  "lots".* FROM "lots" WHERE "lots"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
def edit
  @lot = Lot.find(params[:id])

SELECT  "lots".* FROM "lots" WHERE "lots"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
UPDATE "lots" SET "lotNumber" = $1, "updated_at" = $2 WHERE "lots"."id" = $3  [["lotNumber", "R312"], ["updated_at", "2020-05-19 02:48:32.223071"], ["id", 31]]
---
def update
@lot = Lot.find(params[:id])
@lot.update(lot_params)

SELECT  "lots".* FROM "lots" WHERE "lots"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
DELETE FROM "lots" WHERE "lots"."id" = $1  [["id", 50]]
---
  def destroy
      #if Boardfollowee.exists?(user_id: current_user.id, boardfollowee_id: params[:id] )
      #puts "does exist"
      #  @boardfollowee = Boardfollowee.find_by user_id: current_user.id, boardfollowee_id: params[:id]
      @lot = Lot.find(params[:id])
      @lot.destroy